#### Terraform Plan 📖 success
```
statuspage_component.api["123"]: Refreshing state... [id=mht2q4vmxh5k]
pagerduty_user.aviv: Refreshing state... [id=P61JOXI]
statuspage_component.explorer["123"]: Refreshing state... [id=4t80qq7z80rc]
statuspage_component.dash["123"]: Refreshing state... [id=h4pdkyxn7djv]
google_compute_global_address.main: Refreshing state... [id=projects/explore-293719/global/addresses/main]
google_storage_bucket.dash: Refreshing state... [id=spacemesh-dash]
google_storage_bucket.explorer: Refreshing state... [id=spacemesh-explorer]
cloudflare_zone.main: Refreshing state... [id=9d27bbf82e1d255b18fbc36e61e4e358]
pagerduty_escalation_policy.main: Refreshing state... [id=P0A7W6U]
google_compute_backend_bucket.dash: Refreshing state... [id=projects/explore-293719/global/backendBuckets/spacemesh-dash]
google_compute_backend_bucket.explorer: Refreshing state... [id=projects/explore-293719/global/backendBuckets/spacemesh-explorer]
google_storage_default_object_access_control.dash: Refreshing state... [id=spacemesh-dash/allUsers]
google_storage_default_object_access_control.explorer: Refreshing state... [id=spacemesh-explorer/allUsers]
pagerduty_service.api["123"]: Refreshing state... [id=PUR4OQL]
pagerduty_service.dash["123"]: Refreshing state... [id=P65MO4G]
pagerduty_service.explorer["123"]: Refreshing state... [id=P2WBNST]
pagerduty_service_integration.dash["123"]: Refreshing state... [id=PIKEVVD]
google_compute_url_map.main: Refreshing state... [id=projects/explore-293719/global/urlMaps/main]
pagerduty_service_integration.api["123"]: Refreshing state... [id=PST8E4W]
pagerduty_service_integration.explorer["123"]: Refreshing state... [id=PUTWSCN]
helm_release.dash["123"]: Refreshing state... [id=spacemesh-dash-123]
google_compute_target_http_proxy.main: Refreshing state... [id=projects/explore-293719/global/targetHttpProxies/main]
helm_release.api["123"]: Refreshing state... [id=spacemesh-api-123]
helm_release.explorer["123"]: Refreshing state... [id=spacemesh-explorer-123]
google_compute_global_forwarding_rule.main: Refreshing state... [id=projects/explore-293719/global/forwardingRules/main]
cloudflare_record.dash["123"]: Refreshing state... [id=adcc61bdd0541cd7dd78baf45479f924]
cloudflare_record.explorer["123"]: Refreshing state... [id=2df88736f227f883325174268885ba79]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_service.discover will be created
  + resource "pagerduty_service" "discover" {
      + acknowledgement_timeout = "null"
      + alert_creation          = "create_alerts_and_incidents"
      + auto_resolve_timeout    = "null"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "P0A7W6U"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "discover"
      + status                  = (known after apply)

      + incident_urgency_rule {
          + type    = (known after apply)
          + urgency = (known after apply)

          + during_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }

          + outside_support_hours {
              + type    = (known after apply)
              + urgency = (known after apply)
            }
        }
    }

  # pagerduty_service_integration.discover will be created
  + resource "pagerduty_service_integration" "discover" {
      + html_url          = (known after apply)
      + id                = (known after apply)
      + integration_email = (known after apply)
      + integration_key   = (known after apply)
      + name              = "discover"
      + service           = (known after apply)
      + type              = "events_api_v2_inbound_integration"
      + vendor            = (known after apply)
    }

  # statuspage_component.discover will be created
  + resource "statuspage_component" "discover" {
      + automation_email = (known after apply)
      + id               = (known after apply)
      + name             = "Spacemesh Discover Service"
      + page_id          = "twrbgq249mgx"
      + showcase         = true
      + status           = "operational"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
